Repository: ChristianWia/vignettes
Catalog: datatable-joins-*.po
Languages: fr

source: We can select the **first match**, represented in the next example by `id = 2`.
fr: Nous pouvons sélectionner la **première correspondance**, représentée dans l'exemple suivant par `id = 2`.

source: We can select the **last match**, represented in the next example by `id = 9`.
fr: Nous pouvons sélectionner la **dernière correspondance**, représentée dans l'exemple suivant par `id = 9`.

source: 3.6.2. Cross join
fr: 3.6.2. Jointure croisée

source: If you want to get **all possible row combinations** regardless of any particular id column we can follow the next process:
fr: Si vous voulez obtenir **toutes les combinaisons possibles de lignes** quelque soit l'id de colonne, vous pouvez suivre le processus suivant :

source: Create a new column in both tables with a constant.
fr: Créer une nouvelle colonne dans les deux tables avec une constante.

source: Join both table based on the new column and remove it after ending the process, as it doesn't have reason to stay after joining.
fr: Joindre les deux tables en fonction de la nouvelle colonne et supprimer cette dernnière à la fin de la manipulation parce qu'il n'y a pas de raison pour la garder.

source: 3.7. Full join
fr: 3.7. Jointure complète

source: Use this method if you need to combine columns from 2 tables based on one or more references ***without removing any row***.
fr: Utilisez cette méthode pour combiner les colonnes de deux tables en se basant sur une ou plusieurs références mais ***sans supprimer aucune ligne***.

source: As we saw in the previous section, any of the prior operations can keep the missing `product_id = 6` and the **soda** (`product_id = 4`) as part of the results.
fr: Comme vu dans la section précédente, toutes les opérations ci-avant peuvent conserver le `product_id = 6` absent et le **soda** (`product_id = 4`) comme faisant partie du résultat.

source: To save this problem, we can use the `merge` function even thought it is lower than using the native `data.table`'s joining syntax.
fr: Pour résoudre ce problème nous pouvons utiliser la fonction `merge` bien qu'elle soit moins préférable à l'utilisation de la syntaxe de jointure native de `data.table`.

source: 4. Non-equi join
fr: 4. Jointure non équilibrée

source: A non-equi join is a type of join where the condition for matching rows is not based on equality, but on other comparison operators like <, >, <=, or >=. This allows for **more flexible joining criteria**. In `data.table`, non-equi joins are particularly useful for operations like:
fr: Une jointure de non équivalence est un type de jointure où la condition pour sélectionner les lignes n'est pas basée sur une égalité mais sur d'autres opérateurs de comparaison tels que <, >, <=, ou >=. Ceci permet des **critères plus flexibles de jointure**. Dans `data.table`, le jointures non équivalentes sont particulièrement utiles pour les opérations telles que :

source: Finding the nearest match
fr: Recherche de la correspondance la plus proche

source: Comparing ranges of values between tables
fr: Comparaison d'intervalles de valeurs entre deux tables

source: It's a great alternative if after applying a right of inner join:
fr: C'est une alternative intéressante si elle est appliquée à droite d'une jointure interne.

source: You want to decrease the number of returned rows based on comparing numeric columns of different table.
fr: Vous souhaitez diminuer le nombre de lignes renvoyées en fonction du résultat de la comparaison des colonnes numériques de tables différentes.

source: You don't need to keep the columns from table `x`*(secondary data.table)* in the final table.
fr: Il n'est pas nécessaire de garder les colonnes de la table `x`*(data.table secondaire)* dans la table finale.

source: To illustrate how this work, let's center over attention on how are the sales and receives for product 2.
fr: Pour illustrer le fonctionnement, concentrons-nous sur les promotions et les réceptions de product 2.

source: If want to know, for example, if can find any receive that took place before a sales date, we can apply the next code.
fr: Si l'on veut savoir par exemple si quelque chose a été reçu avant la date des promotions, nous pouvons utiliser le code suivant.

source: What does happen if we just apply the same logic on the list passed to `on`?
fr: Que se passe-t-il si nous appliquons simplement la même logique à la liste passée à `on` ?

source: As this opperation it's still a right join, it returns all rows from the `i` table, but only shows the values for `id` and `count` when the rules are met.
fr: Comme cette opération est encore une jointure droite, elle renvoie toutes les lignes de la table `i` , mais n'affiche que les valeurs de `id` et `count` lorsque les règles sont vérifiées.

source: The date related `ProductReceivedProd2` was omited from this new table.
fr: La date correspondant à `ProductReceivedProd2` a été omise de cette nouvelle table.

source: Now, after applying the join, we can limit the results only show the cases that meet all joining criteria.
fr: Maintenant après avoir appliqué la jointure, nous pouvons limiter les résultats pour n'afficher que les cas qui satisfont tous les critères de jointure.

source: 5. Rolling join
fr: 5. Jointure glissante

source: Rolling joins are particularly useful in time-series data analysis. They allow you to **match rows based on the nearest value** in a sorted column, typically a date or time column.
fr: Les jointures glissantes sont particulièrement utiles si vous faites des analyses de données sur des séries temporelles. Elles permettent de **prendre en compte les lignes basées sur la valeur la plus proche** dans une colonne triée, typiquement une colonne avec une date ou un horodatage.

source: This is valuable when you need to align data from different sources **that may not have exactly matching timestamps**, or when you want to carry forward the most recent value.
fr: C'est utile lorsque vous avez besoin d'aligner des données de sources différentes **qui n'ont pas forcément les mêmes horodatages**, ou si vous souhaitez continuer avec la valeur la plus récente.

source: For example, in financial data, you might use a rolling join to assign the most recent stock price to each transaction, even if the price updates and transactions don't occur at the exact same times.
fr: Par exemple, avec des données financières, vous pourriez utiliser une jointure glissante pour assigner la valeur la plus récente d'une action à chaque transaction, même si les mises à jour du prix et les transactions ne correspondent pas exactement aux mêmes instants.

source: In our supermarket example, we can use a rolling join to match sales with the most recent product information.
fr: Dans notre exemple de supermarché nous pouvons utiliser une jointure glissante pour correspondre aux promotions avec les informations de produit les plus récentes.

source: Let's assume that the price for Bananas and Carrots changes at the first date of each month.
fr: Supposons que le prix des bananes et des carottes change le premier jour de chaque mois.

source: Now, we can perform a right join giving a different prices for each product based on the sale date.
fr: Maintenant nous pouvons réaliser une jointure droite en donnant un prix différent à chaque produit en fonction de la date de promotion.

source: If we just want to see the matching cases we just need to add the argument `nomatch = NULL` to perform an inner rolling join.
fr: Si nous voulons simplement voir les cas de correspondance, il suffit d'ajouter l'argument `nomatch = NULL` pour réaliser une jointure glissante en interne.

source: 7. Taking advange of joining speed
fr: 7. Avantage de la vitesse de jointure

source: 7.1. Subsets as joins
fr: 7.1. Sous-ensembles en tant que jointures

source: As we just saw in the prior section the `x` table gets filtered by the values available in the `i` table. Actually, that process is faster than passing a Boolean expression to the `i` argument.
fr: Comme nous venons de le voir, dans la section précédente la table `x` est filtrée par les valeurs de la table `i` . Actuellement cette méthode est plus rapide que de passer une expression booléenne dans l'argument `i`.

source: To filter the `x` table at speed we don't to pass a complete `data.table`, we can pass a `list()` of vectors with the values that we want to keep or omit from the original table.
fr: Pour filtrer la table `x` rapidement nous ne passons pas la `data.table` entière, nous pouvons passer une `list()` de vecteurs avec les valeurs de la table originale que nous voulons garder ou omettre.

source: For example, to filter dates where the market received 100 units of bananas (`product_id = 1`) or popcorn (`product_id = 3`) we can use the following:
fr: Par exemple pour filtrer les dates auxquelles le marché a reçu 100 unités de bananes (`product_id = 1`) ou de popcorn (`product_id = 3`) nous pouvons utiliser ceci :

source: As at the end, we are filtering based on a join operation the code returned a **row that was not present in original table**. To avoid that behavior, it is recommended to always to add the argument `nomatch = NULL`.
fr: Nous voici à la fin, nous filtrons le code **ligne absente dans la table originale** renvoyé suite à la jointure. Pour éviter ce comportement il est recommandé de toujours ajouter l'argument `nomatch = NULL`.

source: We can also use this technique to filter out any combination of values by prefixing them with `!` to negate the expression in the `i` argument and keeping the `nomatch` with its default value. For example, we can filter out the 2 rows we filtered before.
fr: Nous pouvons aussi utiliser cette technique pour filtrer toute combinaison de valeurs en les préfixant avec `!` pour obtenir la négation de l'expression dans l'argument `i` et en gardant le `nomatch` à sa valeur par défaut. Par exemple nous pouvons filtrer les deux lignes filtrées précédemment.

source: If you just want to filter a value for a single **character column**, you can omit calling the `list()` function pass the value to been filtered in the `i` argument.
fr: Si vous voulez simplement filtrer une valeur pour une **colonne de caractères** seule, vous pouvez ne pas appeler la fonction `list()` et passer la valeur pour être filtrée dans l'argument `i`.

source: 7.2. Updating by reference
fr: 7.2. Mise à jour par référence

source: The `:=` operator in data.table is used for updating or adding columns by reference. This means it modifies the original data.table without creating a copy, which is very memory-efficient, especially for large datasets. When used inside a data.table, `:=` allows you to **add new columns** or **modify existing ones** as part of your query.
fr: L'opérateur `:=` de data.table est utilisé pour mettre à jour ou ajouter des colonnes par référence. Cela signifie qu'il modifie la data.table originale sans créer de copie , ce qui est très efficace en termes de mémoire, particulièrement avec les grands ensembles de données. Lorsqu'il est utilisé à l'intérieur d'une data.table, `:=` permet d'**ajouter de nouvelles colonnes** ou de **modifier des colonnes existantes** à l'intérieur d'une même requête.

source: Let's update our `Products` table with the latest price from `ProductPriceHistory`:
fr: Mettons à jour notre table `Products` avec le dernier prix connu de `ProductPriceHistory` :

source: In this operation:
fr: Dans cette opération :

source: The function `copy` prevent that `:=` changes by reference the `Products` table.s
fr: La fonction `copy` empêche que `:=` modifie par référence les tables `Products`.

source: We join `Products` with `ProductPriceHistory` based on `id` and `product_id`.
fr: Nous réalisons la jointure de `Products` avec `ProductPriceHistory` en fonction de `id` et de `product_id`.

source: We update the `price` column with the latest price from `ProductPriceHistory`.
fr: Nous mettons à jour la colonne `price` avec le prix le plus récent de `ProductPriceHistory`.

source: We add a new `last_updated` column to track when the price was last changed.
fr: Nous ajoutons une nouvelle colonne `last_updated` qui mémorisera la date du dernier changement de prix.

source: The `by = .EACHI` ensures that the `tail` function is applied for each product in `ProductPriceHistory`.
fr: Le `by = .EACHI` assure que la fonction `tail` est appliquée à chaque produit de `ProductPriceHistory`.

source: Reference
fr: Référence

source: *Understanding data.table Rolling Joins*: https://www.r-bloggers.com/2016/06/understanding-data-table-rolling-joins/
fr: *Comprendre les jointures glissantes de data.table*: https://www.r-bloggers.com/2016/06/understanding-data-table-rolling-joins/

source: *Semi-join with data.table*: https://stackoverflow.com/questions/18969420/perform-a-semi-join-with-data-table
fr: *Demi-jointure avec data.table*: https://stackoverflow.com/questions/18969420/perform-a-semi-join-with-data-table

source: *Cross join with data.table*: https://stackoverflow.com/questions/10600060/how-to-do-cross-join-in-r
fr: *Jointure croisée avec with data.table*: https://stackoverflow.com/questions/10600060/how-to-do-cross-join-in-r

source: *How does one do a full join using data.table?*: https://stackoverflow.com/questions/15170741/how-does-one-do-a-full-join-using-data-table
fr: *Comment réaliser une jointure complète à l'aide de data.table ?*: https://stackoverflow.com/questions/15170741/how-does-one-do-a-full-join-using-data-table

source: *Enhanced data.frame*: https://rdatatable.gitlab.io/data.table/reference/data.table.html
fr: *data.frame étendu*: https://rdatatable.gitlab.io/data.table/reference/data.table.html
