Repository: ChristianWia/vignettes
Catalog: datatable-joins-*.po
Languages: fr

source: title: "Joins in data.table" date: "`r Sys.Date()`" output: markdown::html_format vignette: > %\VignetteIndexEntry{Joins in data.table} %\VignetteEngine{knitr::knitr} \usepackage[utf8]{inputenc} editor_options: chunk_output_type: console
fr: title: "Jointures avec data.table" date: "`r Sys.Date()`" output: markdown::html_format vignette: > %\VignetteIndexEntry{Joins in data.table} %\VignetteEngine{knitr::knitr} \usepackage[utf8]{inputenc} editor_options: chunk_output_type: console

source: In this vignette you will learn how to perform any join operation using resources available in the `data.table` syntax.
fr: Dans cette vignette nous apprendrons à réaliser les opérations de jointure en utilisant les ressources de la syntaxe `data.table`.

source: It assumes familiarity with the `data.table` syntax. If that is not the case, please read the following vignettes:
fr: Cela suppose que vous êtes déjà familiarisé avec la syntaxe `data.table` . Si ce n'est pas le cas, reportez-vous aux vignettes suivantes :

source: 1. Defining example data
fr: 1. Définissons nos données d'exemple

source: To illustrate how to use the method available with real life examples, let's simulate a **normalized database** from a little supermarket by performing the following steps:
fr: Pour illustrer la méthode proposée avec des exemples de la vie courante, nous allons simuler une **base de données normalisée** à partir d'un petit supermarché en réalisant les étapes suivantes :

source: Defining a `data.table` where each product is represented by a row with some qualities, but leaving one product without `id` to show how the framework deals with ***missing values***.
fr: Définir une `data.table` où chaque produit est représenté par une ligne avec quelques attributs, mais en laissant un produit sans `id` pour montrer comment d'environnement réagit avec les ***valeurs absentes***.

source: Defining a `data.table` showing the proportion of taxes to be applied for processed products based on their units.
fr: Définir une `data.table` donnant le pourcentage des taxes à appliquer aux produits traités en fonction de leurs unités.

source: Defining a `data.table` simulating the products received every Monday with a `product_id` that is not present in the `Products` table.
fr: Définir une `data.table` simulant les produits reçus chaque lundi avec des `product_id` non présents dans la table `Products` .

source: Defining a `data.table` to show some sales that can take place on weekdays with another `product_id` that is not present in the `Products` table.
fr: Définir une `data.table` pour afficher des promotions certains jours de la semaine avec un autre `product_id` qui n'est pas dans la table `Products` .

source: 2. `data.table` joining syntax
fr: 2. Syntaxe le la jointure `data.table`

source: Before taking advantage of the `data.table` syntax to perform join operations we need to know which arguments can help us to perform successful joins.
fr: Avant de voir les avantages de la syntaxe `data.table` pour faire des opérations de jointure nous devons savoir quels arguments peuvent nous aider à les réaliser avec succès.

source: Please keep in mind that the standard argument order in data.table is `dt[i, j, by]`. For join operations, it is recommended to pass the `on` and `nomatch` arguments by name to avoid using `j` and `by` when they are not needed.
fr: N'oubliez pas que l'ordre standard des arguments dans data.table est `dt[i, j, by]`. Pour les opérations de jointure, il est recommandé de passer les arguments `on` et `nomatch` par nom pour éviter d'utiliser `j` et `by` quand ce n'est pas nécessaire.

source: 3. Equi joins
fr: 3. Jointures équilibrées

source: This the most common and simple case as we can find common elements between tables to combine.
fr: C'est le cas général et facile où il y a des éléments communs entre les tables à combiner.

source: The relationship between tables can be:
fr: La relation entre les tables peut être :

source: **One to one**: When each matching value is unique on each table.
fr: **De un à un**: lorsque chaque valeur sélectionnée est unique dans chaque table.

source: **One to many**: When some matching values are repeated in one of the table both unique in the other one.
fr: **De un à plusieurs** : lorsque certaines valeurs sélectionnées sont répétées dans une table et à la fois uniques dans l'autre.

source: **Many to many**: When the matching values are repeated several times on each table.
fr: **De plusieurs à plusieurs** : lorsque les valeurs sélectionnées sont répétées plusieurs fois dans chaque table.

source: In most of the following examples we will perform *one to many* matches, but we are also going to take the time to explain the resources available to perform *many to many* matches.
fr: Dans laplupart des exemples suivants nous réaliserons des correspondances *un vers plusieurs* , mais nous prendrons aussi le temps d'expliquer les ressources disponibles pour réaliser les correspondances *de plusieurs vers plusieurs* .

source: 3.1. Right join
fr: 3.1. Jointure droite

source: Use this method if you need to combine columns from 2 tables based on one or more references but ***keeping all rows present in the table located on the right (in the the square brackets)***.
fr: Utilisez cette méthode pour combiner les colonnes de deux tables en se basant sur une ou plusieurs références mais ***en gardant toutes les lignes présentes dans la table située à droite (entre crochets)***.

source: In our supermarket context, we can perform a right join to see more details about the products received as this is relation *one to many* by passing a vector to the `on` argument.
fr: Dans le contexte de notre supermarché nous pouvons réaliser une jointure droite pour voir davantage de détails à propos des produits reçus parce que c'est une relation de *un vers plusieurs* en passant un vecteur dans l'argument `on`.

source: As many things have changed, let's explain the new characteristics in the following groups:
fr: Comme beaucoup de choses ont changé, nous allons expliquer les nouvelles caractéristiques dans les groupes suivants :

source: **Column level**
fr: **Niveau colonne**

source: The *first group* of columns in the new data.table comes from the `x` table.
fr: Le *premier groupe* de colonnes dans le nouveau data.table vient de la table `x` .

source: The *second group* of columns in the new data.table comes from the `i` table.
fr: Le *second groupe* de colonnes de la nouvelle data.table vient de la table `i`.

source: If the join operation presents a present any **name conflict** (both table have same column name) the ***prefix*** `i.` is added to column names from the **right-hand table** (table on `i` position).
fr: Si l'opération de jointure fait apparaître un **conflit de nom** (les deux tables ont le même nom de colonne) le ***prefixe*** `i.` est ajouté aux noms des colonnes de la **table de droite** (table en position `i`).

source: **Row level**
fr: **Niveau ligne**

source: The missing `product_id` present on the `ProductReceived` table in row 1 was successfully matched with missing `id` of the `Products` table, so `NA` ***values are treated as any other value***.
fr: Le `product_id` qui est absent, mais présent dans la table `ProductReceived` à la ligne 1 a été sélectionné avec le `id` absent de la table `Products`, donc ***les valeurs `NA` sont traitées comme les autres valeurs***.

source: All rows from in the `i` table were kept including:
fr: Toutes les lignes de la table `i` ont été gardées y compris :

source: Not matching rows like the one with `product_id = 6`.
fr: Les lignes qui ne correspondent pas, comme celle avec `product_id = 6`.

source: Rows that repeat the same `product_id` several times.
fr: Lignes qui répètent les même `product_id` plusieurs fois.

source: 3.1.1. Joining by a list argument
fr: 3.1.1. Jointure avec un argument de liste

source: If you are following the vignette, you might have found out that we used a vector to define the relations between tables in the `on` argument, that is really useful if you are **creating your own functions**, but another alternative is to use a **list** to define the columns to match.
fr: Si vous suivez la vignette, vous avez pu voir que nous avons utilisé un vecteur pour définir les relations entre les tables dans l'argument `on`, ce qui réellement utile si vous **créez vos propres fonctions**, mais une autre alternative est d'utiliser une **liste** pour définir les colonnes à sélectionner.

source: To use this capacity, we have 2 equivalent alternatives:
fr: Pour utiliser cette capacité, nous avons a disposition les alternatives suivantes :

source: Wrapping the related columns in the base R `list` function.
fr: Inclure les colonnes associées dans la fonction R de base `list` .

source: Wrapping the related columns in the data.table `list`alias `.`.
fr: Inclure les colonnes associées dans la data.table `list`alias `.`.

source: 3.1.2. Alternatives to define the `on` argument
fr: 3.1.2. Alternatives pour définir l'argument `on`

source: In all the prior example we have pass the column names we want to match to the `on` argument but `data.table` also have alternatives to that syntax.
fr: Dans tous les exemples précédents, nous avons passé les noms des colonnes à sélectionner avec l'argument `on` mais `data.table` possède également des alternatives à cette syntaxe.

source: **Natural join**: Selects the columns to perform the match based on common column names. To illustrate this method, let's change the column of `Products` table from `id` to `product_id` and use the keyword `.NATURAL`.
fr: **Jointure naturelle**: sélectionne les colonnes pour réaliser la correspondance en fonction des noms des colonnes communes. Pour illustrer cette méthode, modifions la colonne de la table `Products` de `id` en `product_id` et utilisons le mot clé `.NATURAL`.

source: **Keyed join**: Selects the columns to perform the match based on keyed columns regardless of their names.To illustrate this method, we need to define keys in the same order for both tables.
fr: **Jointure par clé**: sélectionne les colonnes pour rechercher la correspondance en fonction des colonnes clé quelque soit leur nom. Pour illustrer cette méthode, nous devons définir les clés dans le même ordre pour les deux tables.

source: 3.1.3. Operations after joining
fr: 3.1.3. Opérations après la jointure

source: Most of the time after a join is complete we need to make some additional transformations. To make so we have the following alternatives:
fr: La plupart du temps après avoir terminé une jointure nous souhaitons faire des adaptations supplémentaires. Pour cela plusieurs alternatives vous sont proposées :

source: Chaining a new instruction by adding a pair of brakes `[]`.
fr: Chaîner une nouvelle instruction en ajoutant une paire de crochets `[]`.

source: Passing a list with the columns that we want to keep or create to the `j` argument.
fr: En passant comme argument `j` une liste des colonnes que l'on veut conserver ou créer.

source: Our recommendation is to use the second alternative if possible, as it is **faster** and uses **less memory** than the first one.
fr: Notre recommendation est d'utiliser la seconde alternative si possible, car elle est **plus rapide** et demande **moins de mémoire** que la première.

source: Managing shared column Names with the j argument
fr: Gestion de la colonne partagée Names avec l'argument j

source: The `j` argument has great alternatives to manage joins with tables **sharing the same names for several columns**. By default all columns are taking their source from the the `x` table, but we can also use the `x.` prefix to make clear the source and use the prefix `i.` to use any column form the table declared in the `i` argument of the `x` table.
fr: L'argument `j` autorise plusieurs alternatives intéressantes pour gérer les jointures avec les tables en **partageant les mêmes noms de plusieurs colonnes**. Par défaut toutes les colonnes prennent leur source dans la table `x`, mais nous pouvons aussi utiliser le préfixe `x.` pour clarifier la source et utiliser le préfixe `i.` pour toutes les colonnes de la table déclarée dans l'argument `i` de la table `x`.

source: Going back to the little supermarket, after updating the `ProductReceived` table with the `Products` table, it seems convenient apply the following changes:
fr: Si nous retournons au petit supermarché, après avoir mis à jour la table `ProductReceived` avec la table `Products` , il semble pratique d'appliquer les modifications suivantes :

source: Changing the columns names from `id` to `product_id` and from `i.id` to `received_id`.
fr: Modifier le nom des colonnes de `id` en `product_id` et de `i.id` en `received_id`.

source: Adding the `total_value`.
fr: Ajout de `total_value`.

source: Summarizing with on in data.table
fr: Résumé avec on dans data.table

source: We can also use this alternative to return aggregated results based columns present in the `x` table.
fr: Nous pouvons aussi utiliser cette alternative pour renvoyer les résultats agrégés enn fonction des colonnes présentes dans la table `x` .

source: For example, we might interested in how much money we expend buying products each date regardless the products.
fr: Par exemple on pourrait s'intéresser à combien on dépense à acheter des produits à chaque date quelque soit ces produits.

source: 3.1.4. Joining based on several columns
fr: 3.1.4. Jointure basée sur plusieurs colonnes

source: So far we have just joined `data.table` base on 1 column, but it's important to know that the package can join tables matching several columns.
fr: Jusqu'à présent, nous avons réalisé les jointures en se basant sur une colonne `data.table`, mais il est important de savoir que le package peut joindre des tables en prenant en compte plusieurs colonnes.

source: To illustrate this, let's assume that we want to add the `tax_prop` from `NewTax` to **update** the `Products` table.
fr: Pour illustrer cela supposons que nous voulions ajouter `tax_prop` de `NewTax` pour **mettre à jour** la table `Products`.

source: 3.2. Inner join
fr: 3.2. Jointure interne

source: Use this method if you need to combine columns from 2 tables based on one or more references but ***keeping only rows matched in both tables***.
fr: Utilisez cette méthode pour combiner les colonnes de deux tables en se basant sur une ou plusieurs références mais ***en gardant seulement les lignes sélectionnées dans les deux tables***.

source: To perform this operation we just need to add `nomatch = NULL` or `nomatch = 0` to any of the prior join operations to return the same results.
fr: Pour réaliser cette opération il suffit d'ajouter `nomatch = NULL` ou `nomatch = 0` à l'une quelconque des opérations de jointure précédentes pour renvoyer le même résultat.

source: Despite both tables have the same information, they present some relevant differences:
fr: Même si les deux tables contiennent la même information, il existe quelques différences importantes :

source: They present different order for their columns
fr: Elles présentent un ordre différent pour leurs colonnes

source: They have some name differences on their columns names:
fr: Elles comportent certaines différences de noms dans le nom des colonnes :

source: The `id` column of first table has the same information as the `product_id` in the second table.
fr: La colonne `id` de la première table contient les mêmes informations que `product_id` de la seconde table.

source: The `i.id` column of first table has the same information as the `id` in the second table.
fr: La colonne `i.id` de la première table a les mêmes informations que `id` de la seconde table.

source: 3.3. Not join
fr: 3.3. Non jointure

source: This method **keeps only the rows that don't match with any row of a second table**.
fr: Cette méthode extrait **ne garde que les lignes qui ne correspondent pas à n'importe quelle ligne d'une seconde table**.

source: To apply this technique we just need to negate (`!`) the table located on the `i` argument.
fr: Pour appliquer cette technique il suffit d'utiliser la négation (`!`) sur la table qui se trouve dans l'argument `i` .

source: As you can see, the result only has 'banana', as it was the only product that is not present in the `ProductReceived` table.
fr: Comme on peut le voir, le résultat ne comporte que les bananes car c'est le seul produit qui ne figure pas dans la table `ProductReceived`.

source: In this case, the operation returns the row with `product_id = 6,` as it is not present on the `Products` table.
fr: Dans ce cas l'opération renvoie la ligne de `product_id = 6,` car il ne figure pas dans la table `Products`.

source: 3.4. Semi join
fr: 3.4. Semi jointure

source: This method extract **keeps only the rows that match with any row in a second table** without combining the column of the tables.
fr: Cette méthode extrait **ne garde que les lignes qui correspondent à n'importe quelle ligne d'une seconde table** sans combiner la colonne des tables.

source: It's very similar to subset as join, but as in this time we are passing a complete table to the `i` we need to ensure that:
fr: En tant que jointure ceci est très similaire au sous-ensemble, mais comme cette fois nous passons une table complète dans `i` nous devons vérifier que :

source: Any row in the `x` table is duplicated due row duplication in the table passed to the `i` argument.
fr: Chaque ligne de la table `x` est dupliquée à cause de la duplication des lignes dans la table passée dans l'argument `i`.

source: All the renaming rows from `x` should keep the original row order.
fr: Toutes les lignes renommées de `x` doivent conserver l'ordre originel des lignes.

source: To make this, you can apply the following steps:
fr: Pour faire ceci, suivez les étapes ci-après :

source: Perform a **inner join** with `which = TRUE` to save the row numbers related to each matching row of the `x` table.
fr: Réaliser une **jointure interne** avec `which = TRUE` pour sauvegarder les numéros de ligne liés à chaque ligne sélectionnée de la table `x` .

source: Select and sort the unique rows ids.
fr: Sélectionner et trier les id uniques de lignes.

source: Selecting the `x` rows to keep.
fr: Sélectionner les `x` rangées à garder.

source: 3.5. Left join
fr: 3.5. Jointure gauche

source: Use this method if you need to combine columns from 2 tables based on one or more references but ***keeping all rows present in the table located on the left***.
fr: Utilisez cette méthode pour combiner les colonnes de deux tables en se basant sur une ou plusieurs références mais ***en gardant toutes les lignes présentes dans la table située à gauche***.

source: To perform this operation, we just need to **exchange the order between both tables** and the columns names in the `on` argument.
fr: Pour réaliser cette opération, il suffit d'**échanger l'ordre entre les deux tables** ainsi que le nom des colonnes dans l'argument `on`.

source: Here some important considerations:
fr: Voici des éléments importants à prendre en compte :

source: The *first group* of columns now comes from the `ProductReceived` table as it is the `x` table.
fr: Le *premier groupe* de colonnes vient maintenant de la table `ProductReceived` car il est la table `x` .

source: The *second group* of columns now comes from the `Products` table as it is the `i` table.
fr: Le *second groupe* de colonnes vient maintenant de la table `Products` car il est la table `i` .

source: It didn't add the prefix `i.` to any column.
fr: Le préfixe `i.` n'a été ajouté à aucune colonne.

source: All rows from in the `i` table were kept as we never received any banana but row is still part of the results.
fr: Toutes les lignes de la table `i` ont été gardées car nous n'avons jamais reçu de bananes et la ligne fait toujours partie des résultats.

source: The row related to `product_id = 6` is no part of the results any more as it is not present in the `Products` table.
fr: La ligne concernant `product_id = 6` ne fait plus partie des résultats car elle n'est pas présente dans la table `Products`.

source: 3.5.1. Joining after chain operations
fr: 3.5.1. Jointure après des opérations sur les chaînes

source: One of the key features of `data.table` is that we can apply several operations before saving our final results by chaining brackets.
fr: Une des fonctionnalités clé de `data.table` est que l'on peut appliquer plusieurs opérations en chaînant les crochets, avant d'enregistrer le résultat final.

source: So far, if after applying all that operations **we want to join new columns without removing any row**, we would need to stop the chaining process, save a temporary table and later apply the join operation.
fr: Jusqu'à présent, si après avoir exécuté toutes ces opérations **nous souhaitons joindre de nouvelles colonnes sans supprimer aucune ligne**, il faut arrêter le processus de chaînage, sauvegarder dans une table temporaire puis effectuer ultérieurement l'opération de jointure.

source: To avoid that situation, we can use special symbols `.SD`, to apply a **right join based on the changed table**.
fr: Pour éviter cette situation, nous pouvons utiliser le symbole spécial `.SD`, pour appliquer une **jointure droite en fonction de la table modifiée**.

source: 3.6. Many to many join
fr: 3.6. Jointure de plusieurs à plusieurs

source: To illustrate this situation let's take as an example the `product_id == 1L`, which have 4 rows in our `ProductReceived` table.
fr: Pour illustrer cette situation, prenons par exemple le `product_id == 1L`, qui a quatre lignes dans notre table `ProductReceived` .

source: And 4 rows in our `ProductSales` table.
fr: Et quatre rangées dans notre table `ProductSales`.

source: To perform this join we just need to filter `product_id == 1L` in the `i` table to limit the join just to that product and set the argument `allow.cartesian = TRUE` to allow combining each row from one table with every row from the other table.
fr: Pour réaliser cette jointure il nous suffit de filtrer `product_id == 1L` dans la table `i` pour limiter la jointure uniquement à ce produit et déclarer l'argument `allow.cartesian = TRUE` pour permettre la combinaison de chaque ligne d'une table avec chaque ligne de l'autre table.

source: Once we understand the result, we can apply the same process for **all products**.
fr: Une fois que nous avons assimilé les résultats, nous pouvont appliquer le même processus pour **tous les produits**.

source: `allow.cartesian` is defaulted to FALSE as this is seldom what the user wants, and such a cross join can lead to a very large number of rows in the result. For example, if Table A has 100 rows and Table B has 50 rows, their Cartesian product would result in 5000 rows (100 * 50). This can quickly become memory-intensive for large datasets.
fr: `allow.cartesian` vaut par défaut FALSE car c'est ce que l'utilisateur a souhaité, et une telle jointure croisée peut conduire à un très grand nombre de lignes dans le résultat. Par exemple, si Table A possède 100 lignes et Table B en a 50, leur produit cartésien sera 5000 lignes (100 * 50). Ce qui peut rapidement accroître la mémoire occupée pour de grands ensembles de données.

source: 3.6.1. Selecting one match
fr: 3.6.1. Selection d'une correspondance

source: After joining the table we might find out that we just need to return a single join to extract the information we need. In this case we have 2 alternatives:
fr: Après avoir fait la jointure de la table, nous pourrions penser qu'on aurait pu utiliser une seule jointure pour extraire les informations nécessaires. Dans ce cas il y a deux alternatives :
